In [1]:
import sys

sys.path.append("..")

from src.auth.aurora import get_portal_client

In [2]:
portal_client = get_portal_client()

In [ ]:
df = portal_client.query_to_pandas(
    """SELECT DISTINCT test_template.test_id
    FROM (
        SELECT
            DISTINCT test.id AS test_id, test.site_id, test.created_at, task_template.template_id, task_template.asset_type
        FROM topaz.api_service_tests AS test
        INNER JOIN topaz.api_service_tasks_record AS task_record
        ON test.id = task_record.test_id
        INNER JOIN topaz.api_service_tasks AS task_template
        ON task_record.task_id = task_template.id
        AND test.created_at BETWEEN task_template.created_at AND IFNULL(task_template.deleted_at, CURRENT_TIMESTAMP())
        WHERE task_template.asset_type != ''
    ) AS test_template
    LEFT JOIN topaz.api_service_tasks AS task_template
    ON test_template.template_id = task_template.template_id
    AND (
        test_template.asset_type = task_template.asset_type
        OR task_template.asset_type = ''
    )
    AND test_template.created_at BETWEEN task_template.created_at AND IFNULL(task_template.deleted_at, CURRENT_TIMESTAMP())
    LEFT JOIN topaz.api_service_tasks_record AS task_record
    ON task_record.task_id = task_template.id
    AND task_record.test_id = test_template.test_id
    WHERE task_template.type IN (1, 3)
    AND task_record.id IS NULL
    """
)

In [4]:
df

       test_id
0       322740
1       330610
2       330657
3       332712
4       332713
...        ...
1744  14075929
1745  14076059
1746  14077937
1747  14077994
1748  14110202

[1749 rows x 1 columns]